InformationRegisters/CRM_НовостиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_НовостиДилеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаРОП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМенеджеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаРесепшн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаСервису</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Renault_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаВсемПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМеханикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМенеджеруПоКорпоративнымПродажам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ПрочитанныеНовости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ПрочитанныеНовости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прочитана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ОткрытыеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ОткрытыеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_ПриНачалеРаботыКлиент/Ext/Module.bsl
#Если Клиент Тогда

Процедура Renault_ПриНачалеРаботы() Экспорт
	
	ОбновитьПраваРено();
	ТекущиеПраваПользователя = ПараметрыСеанса.Renault_ПраваПользователя;
	
	Попытка 
		ОчиститьИнформациюПоОткрытымФормам();
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
		
		ЗапуститьОбработкиПоУмолчанию(ТекущиеПраваПользователя);
		//Подключим обработчик ожидания для периодической проверки наличия новых новостей
		ПодключитьОбработчикОжидания("глПроверкаНаличияНовостей",60);
		Бренд = ПараметрыСеанса.DMS_Бренд.Наименование;
		если Бренд = "" Тогда
			Возврат;
		КонецЕсли;
		
		ИнтервалНапоминанияОТС = Справочники.Renault_СлужебныеНастройкиБазыДанных[Бренд].ИнтервалНапоминанияОТС;
		
		Если ИнтервалНапоминанияОТС > 0 Тогда
			
			ПодключитьОбработчикОжидания("глRenault_НапоминанияОТО",ИнтервалНапоминанияОТС);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Автоматический запуск обработки регистрации входящих звонков. 
	Если Найти(ПараметрЗапуска, "РегистрироватьЗвонки")  > 0  Тогда
		ОткрытьФорму("Обработка.DMS_РегистрацияВходящихЗвонков.Форма.Панель");
	КонецЕсли;
	
	//автообновление
	ОткрытьФорму("Обработка.Renault_ПереходНаНовуюВерсию.Форма.ФормаУпр",Новый Структура("Автообновление",Истина));
	
КонецПроцедуры

Процедура глRenault_НапоминанияОТО() Экспорт
	
	ПравоНаНовыеАвтомобили = Renault_РаботаСПравамиПользователя.НапоминаниеПоОТСНЕПроданныеАвто(ПараметрыСеанса.Пользователь);
	ПравоНаКлиентскиеАвтомобили =  Renault_РаботаСПравамиПользователя.НапоминаниеПоОТСПроданныеАвто(ПараметрыСеанса.Пользователь);
	
	Если ПравоНаНовыеАвтомобили или ПравоНаКлиентскиеАвтомобили Тогда
		
		Результат = Renault_АвтосервисСервер.СписокОТСВСистеме(ПравоНаНовыеАвтомобили, ПравоНаКлиентскиеАвтомобили);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Форма = ПолучитьОбщуюФорму("Renault_ФормаОповещенияОНаличииОТС");
			Форма.ТаблицаМашинОТС = Результат;
			
			Если НЕ Форма.Открыта() Тогда
				
				Форма.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;
				Форма.Открыть();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура глПроверкаНаличияНовостей() Экспорт
	
	ДоступнаРесепшн = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРесепшена(ПараметрыСеанса.Пользователь);
	ДоступнаМенеджеру = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмМенеджера(ПараметрыСеанса.Пользователь);
	ДоступнаРОП = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь);
	ДоступнаСервису = Renault_РаботаСПравамиПользователя.ЕстьПравоНаЦентрализованныеАкции(ПараметрыСеанса.Пользователь) 
		ИЛИ Renault_РаботаСПравамиПользователя.ЕстьПравоНаОткрытиеАРМАвтосервис(ПараметрыСеанса.Пользователь);
	ПроверитьНаличиеНовостейНаСервере(ДоступнаРесепшн, ДоступнаМенеджеру, ДоступнаРОП, ДоступнаСервису);
	
КонецПроцедуры

Процедура ПроверитьНаличиеНовостейНаСервере(ДоступнаРесепшн, ДоступнаМенеджеру, ДоступнаРОП, ДоступнаСервису)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_НовостиДилеров.ТекстНовости,
	|	CRM_НовостиДилеров.ИдентификаторНовости,
	|	CRM_НовостиДилеров.ЗаголовокНовости
	|ИЗ
	|	РегистрСведений.CRM_НовостиДилеров КАК CRM_НовостиДилеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПрочитанныеНовости КАК CRM_ПрочитанныеНовости
	|		ПО CRM_НовостиДилеров.ИдентификаторНовости = CRM_ПрочитанныеНовости.ИдентификаторНовости
	|			И (CRM_ПрочитанныеНовости.Сотрудник = &ТекущийСотрудник)
	|ГДЕ
	|	CRM_ПрочитанныеНовости.Прочитана ЕСТЬ NULL
	|	И CRM_НовостиДилеров.ДатаНачалаПоказа <= &ТекущаяДата
	|	И (CRM_НовостиДилеров.ДатаОкончанияПоказа >= &ТекущаяДата
	|			ИЛИ CRM_НовостиДилеров.ДатаОкончанияПоказа = ДАТАВРЕМЯ(1, 1, 1))
	|	И ВЫБОР
	|			КОГДА CRM_НовостиДилеров.Renault_Версия = &ПустаяСтрока
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ CRM_НовостиДилеров.Renault_Версия = &ТекущаяВерсия
	|		КОНЕЦ
	|	И (CRM_НовостиДилеров.ДоступнаРесепшн = &ДоступнаРесепшн
	|			ИЛИ CRM_НовостиДилеров.ДоступнаМенеджеру = &ДоступнаМенеджеру
	|			ИЛИ CRM_НовостиДилеров.ДоступнаРОП = &ДоступнаРОП
	|			ИЛИ CRM_НовостиДилеров.ДоступнаСервису = &ДоступнаСервису
	|			ИЛИ CRM_НовостиДилеров.ДоступнаВсемПользователям)";
	Запрос.УстановитьПараметр("ТекущийСотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ДоступнаРесепшн", ДоступнаРесепшн);
	Запрос.УстановитьПараметр("ДоступнаМенеджеру", ДоступнаМенеджеру);
	Запрос.УстановитьПараметр("ДоступнаРОП", ДоступнаРОП);
	Запрос.УстановитьПараметр("ДоступнаСервису", ДоступнаСервису);
	Запрос.УстановитьПараметр("ТекущаяВерсия", Константы.CRM_Версия_Renault.Получить());
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Параметр = Новый Структура("Параметр", Результат.Выгрузить());
		Форма = ПолучитьФорму("Обработка.Renault_РаботаСНовостямиДилеров.Форма.ФормаНовости", Параметр);
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьПанельСообщений() экспорт
	
	Форм = обработки.Renault_СтолСообщений.ПолучитьФорму("Форма");
	Форм.Открыть();
	
КонецПроцедуры

Процедура ОбновитьПраваРено()Экспорт
	
	ПараметрыСеанса.Renault_ПраваПользователя = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(ПараметрыСеанса.Пользователь);
	
КонецПроцедуры

Процедура ОчиститьИнформациюПоОткрытымФормам() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ОткрытыеФормы.Пользователь,
	                      |	Renault_ОткрытыеФормы.ИмяФормы,
	                      |	Renault_ОткрытыеФормы.Компьютер,
	                      |	Renault_ОткрытыеФормы.ПолноеИмяФормы
	                      |ИЗ
	                      |	РегистрСведений.Renault_ОткрытыеФормы КАК Renault_ОткрытыеФормы
	                      |ГДЕ
	                      |	Renault_ОткрытыеФормы.Пользователь = &Пользователь
	                      |	И Renault_ОткрытыеФормы.Компьютер = &Компьютер");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Запрос.УстановитьПараметр("Компьютер", ПараметрыСеанса.Компьютер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.Renault_ОткрытыеФормы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапуститьОбработкиПоУмолчанию(ТекПрава)Экспорт
	
	ДоступнаРесепшн = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРесепшена(ПараметрыСеанса.Пользователь);
	ДоступнаМенеджеру = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмМенеджера(ПараметрыСеанса.Пользователь);
	ДоступнаРОП = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмРОП(ПараметрыСеанса.Пользователь);
	ДоступнаСервису = Renault_РаботаСПравамиПользователя.ЕстьПравоНаЦентрализованныеАкции(ПараметрыСеанса.Пользователь);
	ДоступнаПанельСообщений = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьПанельСообщений(ПараметрыСеанса.Пользователь);
	ЕстьПраваНаЗапускАРМАвтосклад = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмАвтосклад(ПараметрыСеанса.Пользователь);
	ЕстьПравоИспользоватьАрмКонтактЦентр = Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентр(ПараметрыСеанса.Пользователь);
	
	ПроверитьНаличиеНовостейНаСервере(ДоступнаРесепшн, ДоступнаМенеджеру, ДоступнаРОП, ДоступнаСервису);
	
	Если ДоступнаРесепшн Тогда
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмРесепшен(ПараметрыСеанса.Пользователь) Тогда
			Форм = Обработки.Renault_ARM_Администратор.ПолучитьФорму("Форма");
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступнаМенеджеру Тогда
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмМенеджера(ПараметрыСеанса.Пользователь) Тогда
			Форм = Обработки.Renault_ARM_Менеджеры.ПолучитьФорму("Форма");
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступнаРОП Тогда
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмРОП(ПараметрыСеанса.Пользователь) Тогда
			Форм = Обработки.Renault_ARM_Руководитель.ПолучитьФорму("Форма");
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПраваНаЗапускАРМАвтосклад Тогда
		//Корзюков начало
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмАвтосклад(ПараметрыСеанса.Пользователь) Тогда
			ДилерскийЦентрПользователя = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
			
			Если Не ЗначениеЗаполнено(ДилерскийЦентрПользователя) Тогда
				#Если Клиент Тогда
					Предупреждение("Для пользователя не задан дилерский центр!");
				#конецЕсли
				Возврат;
			КонецЕсли;
			
			Если ДилерскийЦентрПользователя.Автосклад_ИспользоватьНовуюФормуСклада = Истина Тогда
				ОткрытьФорму("Обработка.Renault_АРМ_Автосклад_Упр.Форма.ФормаДинамическийСписок");
			Иначе
				ОткрытьФорму("Обработка.Renault_АРМ_Автосклад.Форма");
			КонецЕсли;
			
			
			
			Форм = Обработки.Renault_АРМ_Автосклад.ПолучитьФорму("Форма");
			//Корзюков конец
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПравоИспользоватьАрмКонтактЦентр И (Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентрМенеджер(ПараметрыСеанса.Пользователь) ИЛИ
		Renault_РаботаСПравамиПользователя.ЕстьПравоИспользоватьАрмКонтактЦентрАдминистратор(ПараметрыСеанса.Пользователь)) Тогда
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеАрмКонтактЦентр(ПараметрыСеанса.Пользователь) Тогда
			Форм = Обработки.Renault_АРМ_ContactCenter.ПолучитьФорму("Форма");
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступнаПанельСообщений тогда
		Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеПанельСообщений(ПараметрыСеанса.Пользователь) Тогда
			Форм = Обработки.Renault_СтолСообщений.ПолучитьФорму("Форма");
			Форм.Открыть();
		КонецЕсли;
	КонецЕсли;
	
	Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеПанельИнформацииПланаПродажСотрудника(ПараметрыСеанса.Пользователь) Тогда
		Форма = Обработки.Renault_ПанельИнформацииПланаПродажСотрудника.ПолучитьФорму("Форма");
		Форма.Открыть();
	КонецЕсли; 
	
	Если Renault_РаботаСПравамиПользователя.ЗапускатьПриСтартеПанельТелефонии(ПараметрыСеанса.Пользователь) Тогда
		Форм = Обработки.DMS_ПанельТелефонии.ПолучитьФорму("Панель");
		Форм.Открыть();
	КонецЕсли;
	
	Если ТекПрава.Сервис_ПравоОткрыватьАрмАвтосервиса Тогда
		Если ТекПрава.Сервис_ОткрыватьАрмАвтосервисаПриОткрытии Тогда
			ОткрытьФорму("Обработка.Renault_АвтосервисВыборВерсии.Форма");
		КонецЕсли;
		
		Если ТекПрава.Сервис_ПравоОткрыватьФормуМониторАвтосервиса И 
			ТекПрава.Сервис_ОткрыватьФормуМониторАвтосервисаПриОткрытии Тогда
			ФормаМ = Обработки.Renault_МониторАвтосервиса.ПолучитьФорму("ФормаМонитора");
			ФормаМ.Открыть();
		КонецЕсли;
		
		Если ТекПрава.Сервис_АрмАвтосервис_ПравоОткрыватьФормуИзмененияСтатуса И 
			ТекПрава.Сервис_АрмАвтосервис_ОткрыватьФормуИзмененияСтатусаПриОткрытии Тогда
			ОткрытьФорму("Обработка.Renault_АвтосервисВыборВерсии.Форма.ФормаИзмененияСтатусаРабот");
		КонецЕсли;
		
	КонецЕсли;
	Если ТекПрава.Сервис_АрмАвтосервис_ПравоОткрыватьФормуИзмененияСтатусовМоек И 
			ТекПрава.Сервис_АрмАвтосервис_ОткрыватьФормуИзмененияСтатусовМоекПриОткрытии Тогда
			ОткрытьФорму("Обработка.Renault_ИзменениеСтатусовМоек.Форма");
	КонецЕсли;

	Если ТекПрава.ЗапускатьПриСтартеАРМОФУ Тогда
		ОткрытьФорму("Обработка.Renault_АРМ_ОФУ.Форма.Форма");
	КонецЕсли;
	
	Если ТекПрава.ЗапускатьПриСтартеАРМБСО Тогда
		ОткрытьФорму("Обработка.Renault_АРМСотрудникаСлужбыСтрахования.Форма");
	КонецЕсли;
	
КонецПроцедуры



#КонецЕсли
